---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionTypeId
source: html/6c5767a6-42da-c18f-b21a-785d9222e1bc.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionTypeId Property

Identifies the Id of the angular dimension type which is used to show dimensions.

## Syntax (C#)
```csharp
public ElementId AngularDimensionTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property:
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null